In [2]:
# PANDAS
# Pandas is an open source library that is used for handle data manipulations

In [1]:
import pandas as pd

In [ ]:
# Data Structure of Pandas:
# (1)...Series...> 1-Dimensional array and it contains only values.
# # (2)....DataFrame....> Multidimesional array and it contains values with column name.

In [ ]:
# SERIES>>>>>>>>>>.

In [2]:
a=pd.Series([1,45,78,24])
a

0     1
1    45
2    78
3    24
dtype: int64

In [3]:
type(a)

pandas.core.series.Series

In [ ]:
# <<<<<<<DATA FRAME>>>>>

In [7]:
a = {
    "Emp_ID":[1,2,3,4,5],
    "Emp_Name":["dinesh","anil","kumar","thind","raj"],
    "Domain":["IT","Sales","IT","IT","sales"],
    "Working_hours":[9,4,7,8,5],
    "Salary" : [23000,25000,31000,36000,40000]
}
df=pd.DataFrame(a)
df

   Emp_ID Emp_Name Domain  Working_hours  Salary
0       1   dinesh     IT              9   23000
1       2     anil  Sales              4   25000
2       3    kumar     IT              7   31000
3       4    thind     IT              8   36000
4       5      raj  sales              5   40000

In [8]:
df=pd.DataFrame(a)
#df

In [9]:
type(df)

pandas.core.frame.DataFrame

In [14]:
 df.to_csv("C:\\Users\\dell\\OneDrive\\Desktop\\data\\emp.data.csv")  ## To make a folder

In [16]:
df.to_csv("C:\\Users\\dell\\OneDrive\\Desktop\\data\\emp.data.csv",index=False)

In [12]:
# IMPORT DATA>>>>>>>

In [17]:
df=pd.read_csv("C:\\Users\\dell\\OneDrive\\Desktop\\data\\emp.data.csv")

In [18]:
df

   Emp_ID Emp_Name Domain  Working_hours  Salary
0       1   dinesh     IT              9   23000
1       2     anil  Sales              4   25000
2       3    kumar     IT              7   31000
3       4    thind     IT              8   36000
4       5      raj  sales              5   40000